# DSH_GetDSFieldInfoAt

## Description
Gets Object's Data Sheet field universal and localized sources and label.

```pascal
FUNCTION DSH_GetDSFieldInfoAt(
				hObject        : HANDLE;
				dsName         : STRING;
				VAR fieldIndex : INTEGER;
				VAR outUniSrc  : STRING;
				VAR outLocSrc  : STRING;
				VAR outLabel   : STRING): BOOLEAN;
```

```python
def vs.DSH_GetDSFieldInfoAt(hObject, dsName):
    return (BOOLEAN, fieldIndex, outUniSrc, outLocSrc, outLabel)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|   |
|dsName|STRING|   |
|fieldIndex|INTEGER|   |
|outUniSrc|STRING|   |
|outLocSrc|STRING|   |
|outLabel|STRING|   |

## Examples
```pascal
resultOK := DSH_GetDSFieldInfoAt(hObject, 'Example', 1, 'Example', 'Example', 'Example');
```
```python
import vs

# Gets Object's Data Sheet field universal and localized sources and label.
hObject = vs.FSActLayer()  # handle to the first selected object on the active layer
dsName = 'Example'

ok, fieldIndex, outUniSrc, outLocSrc, outLabel = vs.DSH_GetDSFieldInfoAt(hObject, dsName)
vs.Message('DSH_GetDSFieldInfoAt returned: ' + str((ok, fieldIndex, outUniSrc, outLocSrc, outLabel)))
```

## Version
Availability: from Vectorworks 2020.1

## Category
* Data Sheets